#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.ssh-key.random_pet.ssh_key_name: Refreshing state... [id=sshtruecollie]
data.azurerm_client_config.current: Reading...
module.resource-group.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYTJhN2JlYy0zZDA4LTQxYWEtYTZmYy03ZjZjZmQ3M2NmYWQ7b2JqZWN0SWQ9OTJmNTgyZjQtOTE4ZC00YTRiLTgwNWItNjM2ZDZmODNiNTcyO3N1YnNjcmlwdGlvbklkPWI0MTY3NzA3LTE0ODYtNDAxYS1iYTliLWZiMGZiMDg0MTExNDt0ZW5hbnRJZD02YjdkM2ExZC00YmU2LTQxN2YtOTI5Zi0zN2IwMTE5YmE3OTk=]
module.azure-monitor-workspace.azurerm_monitor_workspace.workspace: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/dev-amw-velidaaks]
module.user_assigned_identity.azurerm_user_assigned_identity.msi: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dev-uai-velidaaks]
module.ssh-key.azapi_resource.ssh_public_key: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshtruecollie]
module.network_contributor_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Authorization/roleAssignments/c3f9c5c0-25fa-e3d2-abe3-b90e3097d89f]
module.acr.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/devacrvelidaaks]
module.managed-grafana.azurerm_dashboard_grafana.grafana: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/dev-grafana-velidaaks]
module.ssh-key.azapi_resource_action.ssh_public_key_gen: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshtruecollie/generateKeyPair]
module.aks.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/dev-velidaaks]
module.acr_pull_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/devacrvelidaaks/providers/Microsoft.Authorization/roleAssignments/0747c87a-6db0-bb19-b7b2-9223cad42248]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.aks.azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/dev-velidaaks"
        name                                = "dev-velidaaks"
        tags                                = {
            "environment" = "dev"
            "owner"       = "willvelida"
        }
        # (36 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {}
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

      + monitor_metrics {}

        # (4 unchanged blocks hidden)
    }

  # module.am-dce.azurerm_monitor_data_collection_endpoint.dce will be created
  + resource "azurerm_monitor_data_collection_endpoint" "dce" {
      + configuration_access_endpoint = (known after apply)
      + id                            = (known after apply)
      + immutable_id                  = (known after apply)
      + kind                          = "Linux"
      + location                      = "australiaeast"
      + logs_ingestion_endpoint       = (known after apply)
      + name                          = "MSProm-australiaeast-dev-velidaaks"
      + public_network_access_enabled = true
      + resource_group_name           = "rg-velidaaks"
    }

  # module.am-dcr.azurerm_monitor_data_collection_rule.dcr will be created
  + resource "azurerm_monitor_data_collection_rule" "dcr" {
      + data_collection_endpoint_id = (known after apply)
      + description                 = "DCR for Azure Monitor Metrics Profile (Managed Prometheus)"
      + id                          = (known after apply)
      + immutable_id                = (known after apply)
      + kind                        = "Linux"
      + location                    = "australiaeast"
      + name                        = "MSProm-australiaeast-dev-velidaaks"
      + resource_group_name         = "rg-velidaaks"

      + data_flow {
          + destinations = [
              + "dev-amw-velidaaks",
            ]
          + streams      = [
              + "Microsoft-PrometheusMetrics",
            ]
        }

      + data_sources {
          + prometheus_forwarder {
              + name    = "PrometheusDataSource"
              + streams = [
                  + "Microsoft-PrometheusMetrics",
                ]
            }
        }

      + destinations {
          + monitor_account {
              + monitor_account_id = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/dev-amw-velidaaks"
              + name               = "dev-amw-velidaaks"
            }
        }
    }

  # module.am-dcr.azurerm_monitor_data_collection_rule_association.dcra will be created
  + resource "azurerm_monitor_data_collection_rule_association" "dcra" {
      + data_collection_rule_id = (known after apply)
      + description             = "Association of DCR. Deleting this association will break the data collection for this AKS Cluster"
      + id                      = (known after apply)
      + name                    = "dcra-dcr-prometheus-aks"
      + target_resource_id      = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/dev-velidaaks"
    }

  # module.monitoring_data_reader_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "92f582f4-918d-4a4b-805b-636d6f83b572"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Data Reader"
      + scope                            = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/dev-amw-velidaaks"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.kubernetes_recording_rules_rule_group will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "kubernetes_recording_rules_rule_group" {
      + cluster_name        = "dev-velidaaks"
      + description         = "Kubernetes Recording Rules Rule Group"
      + id                  = (known after apply)
      + interval            = "PT1M"
      + location            = "australiaeast"
      + name                = "KubernetesRecordingRulesRuleGroup-dev-velidaaks"
      + resource_group_name = "rg-velidaaks"
      + rule_group_enabled  = true
      + scopes              = [
          + "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/dev-amw-velidaaks",
          + "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/dev-velidaaks",
        ]

      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (cluster, namespace, pod, container) (  irate(container_cpu_usage_seconds_total{job="cadvisor", image!=""}[5m])) * on (cluster, namespace, pod) group_left(node) topk by (cluster, namespace, pod) (  1, max by(cluster, namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_cpu_usage_seconds_total:sum_irate"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_working_set_bytes{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_working_set_bytes"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_rss{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_rss"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_cache{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_cache"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_swap{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_swap"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_requests"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_memory:kube_pod_container_resource_requests:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_requests"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_cpu:kube_pod_container_resource_requests:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_limits"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_memory:kube_pod_container_resource_limits:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) ( (kube_pod_status_phase{phase=~"Pending|Running"} == 1) )
            EOT
          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_limits"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_cpu:kube_pod_container_resource_limits:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    label_replace(      kube_pod_owner{job="kube-state-metrics", owner_kind="ReplicaSet"},      "replicaset", "$1", "owner_name", "(.*)"    ) * on(replicaset, namespace) group_left(owner_name) topk by(replicaset, namespace) (      1, max by (replicaset, namespace, owner_name) (        kube_replicaset_owner{job="kube-state-metrics"}      )    ),    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "deployment"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="DaemonSet"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "daemonset"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="StatefulSet"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "statefulset"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="Job"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "job"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum(  node_memory_MemAvailable_bytes{job="node"} or  (    node_memory_Buffers_bytes{job="node"} +    node_memory_Cached_bytes{job="node"} +    node_memory_MemFree_bytes{job="node"} +    node_memory_Slab_bytes{job="node"}  )) by (cluster)
            EOT
          + record     = ":node_memory_MemAvailable_bytes:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum(rate(node_cpu_seconds_total{job="node",mode!="idle",mode!="iowait",mode!="steal"}[5m])) by (cluster) /count(sum(node_cpu_seconds_total{job="node"}) by (cluster, instance, cpu)) by (cluster)
            EOT
          + record     = "cluster:node_cpu:ratio_rate5m"
        }
    }

  # module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.node_recording_rules_rule_group will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "node_recording_rules_rule_group" {
      + cluster_name        = "dev-velidaaks"
      + description         = "Node Recording Rules Rule Group"
      + id                  = (known after apply)
      + interval            = "PT1M"
      + location            = "australiaeast"
      + name                = "NodeRecordingRulesRuleGroup-dev-velidaaks"
      + resource_group_name = "rg-velidaaks"
      + rule_group_enabled  = true
      + scopes              = [
          + "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/dev-amw-velidaaks",
          + "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/dev-velidaaks",
        ]

      + rule {
          + enabled    = true
          + expression = <<-EOT
                count without (cpu, mode) (  node_cpu_seconds_total{job="node",mode="idle"})
            EOT
          + record     = "instance:node_num_cpu:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                1 - avg without (cpu) (  sum without (mode) (rate(node_cpu_seconds_total{job="node", mode=~"idle|iowait|steal"}[5m])))
            EOT
          + record     = "instance:node_cpu_utilisation:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                (  node_load1{job="node"}/  instance:node_num_cpu:sum{job="node"})
            EOT
          + record     = "instance:node_load1_per_cpu:ratio"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                1 - (  (    node_memory_MemAvailable_bytes{job="node"}    or    (      node_memory_Buffers_bytes{job="node"}      +      node_memory_Cached_bytes{job="node"}      +      node_memory_MemFree_bytes{job="node"}      +      node_memory_Slab_bytes{job="node"}    )  )/  node_memory_MemTotal_bytes{job="node"})
            EOT
          + record     = "instance:node_memory_utilisation:ratio"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_vmstat_pgmajfault{job="node"}[5m])
            EOT
          + record     = "instance:node_vmstat_pgmajfault:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_disk_io_time_seconds_total{job="node", device!=""}[5m])
            EOT
          + record     = "instance_device:node_disk_io_time_seconds:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_disk_io_time_weighted_seconds_total{job="node", device!=""}[5m])
            EOT
          + record     = "instance_device:node_disk_io_time_weighted_seconds:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_receive_bytes_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_receive_bytes_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_transmit_bytes_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_transmit_bytes_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_receive_drop_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_receive_drop_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_transmit_drop_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_transmit_drop_excluding_lo:rate5m"
        }
    }

Plan: 6 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @willvelida, Action: `pull_request`*